{"query": "What is the minimum salary required for a personal loan in Bangladesh?", "positive": "Most Bangladeshi banks require a minimum monthly income of around BDT 15,000–20,000 for salaried individuals to qualify for personal loans.", "negatives": ["The interest rate for agricultural loans is usually subsidized by Bangladesh Bank.", "NGOs like BRAC and ASA mainly provide microloans to rural entrepreneurs."]}
{"query": "Can I apply for a car loan without a guarantor in Bangladesh?", "positive": "Some banks in Bangladesh, like Eastern Bank Ltd., allow salaried employees to apply for car loans without guarantors if they meet specific income and employment criteria.", "negatives": ["Cooperative societies mainly focus on agricultural and rural small loans.", "Credit card limits in Bangladesh depend on monthly income and repayment history."]}
{"query": "Do NGO microfinance institutions in Bangladesh require collateral?", "positive": "NGO microfinance loans in Bangladesh, such as those from Grameen Bank and BRAC, are collateral-free and based on group guarantees.", "negatives": ["Property mortgage loans in banks require registered deeds.", "Debit cards in Bangladesh work directly from the customer’s account balance."]}
{"query": "What is the maximum repayment tenure for a home loan in Bangladesh?", "positive": "Bangladeshi banks usually offer home loans with repayment tenures ranging from 5 to 20 years depending on loan size and applicant eligibility.", "negatives": ["Student loans from NGOs are usually short-term and education-specific.", "The NBR issues TIN certificates required for tax filing."]}
{"query": "Do Bangladeshi banks provide salary loans?", "positive": "Yes, many banks in Bangladesh provide salary loans to permanent employees, usually based on a multiple of their monthly salary.", "negatives": ["Agricultural loans are often disbursed through Krishi Bank and cooperatives.", "Mobile banking services like bKash and Nagad are regulated under Bangladesh Bank guidelines."]}
{"query": "Is there a loan scheme for medical treatment in Bangladesh?", "positive": "Banks like Prime Bank and Islami Bank Bangladesh Limited offer personal medical loans for emergency treatment, often requiring minimal documentation.", "negatives": ["Debit card withdrawals are subject to ATM network charges.", "Property inheritance in Bangladesh depends on religious law."]}
{"query": "What is the interest rate for agricultural loans in Bangladesh?", "positive": "Bangladesh Bank sets subsidized interest rates on agricultural loans, often around 4–9%, to support farmers.", "negatives": ["Mutual funds are a common form of investment in the Dhaka Stock Exchange.", "Life insurance policies in Bangladesh usually have 10 to 25 years maturity terms."]}
{"query": "Can students get loans for higher studies in Bangladesh?", "positive": "Some Bangladeshi banks offer student loans for higher education, both domestic and abroad, usually requiring a guardian as guarantor.", "negatives": ["Government bonds in Bangladesh are sold through banks and post offices.", "The annual budget sets revised income tax slabs in Bangladesh."]}
{"query": "Are cooperative loans popular in rural Bangladesh?", "positive": "Yes, cooperative societies play a key role in rural Bangladesh by pooling resources and offering small loans to members, especially for farming and small businesses.", "negatives": ["Credit card cash withdrawals usually have higher fees.", "Mobile financial services have transaction limits set by Bangladesh Bank."]}
{"query": "Can an entrepreneur apply for SME loans under Bangladesh Bank refinance scheme?", "positive": "Bangladesh Bank provides refinance facilities for SME loans, allowing entrepreneurs to access funds at lower interest rates.", "negatives": ["Tax filing deadlines in Bangladesh are usually November 30 each year.", "Insurance companies in Bangladesh are regulated by the Insurance Development and Regulatory Authority (IDRA)."]}
{"query": "What documents are needed to open a savings account in Bangladesh?", "positive": "To open a savings account in Bangladesh, you need a national ID card, two passport-size photos, and proof of address such as a utility bill.", "negatives": ["Personal loans usually require proof of salary or income certificate.", "Agricultural loans are subsidized and monitored by Bangladesh Bank."]}
{"query": "Can a foreigner open a bank account in Bangladesh?", "positive": "Yes, foreigners can open bank accounts in Bangladesh by providing a valid passport, visa, and work/residence permit.", "negatives": ["Debit cards in Bangladesh are linked directly to the account balance.", "NGO loans in rural areas are collateral-free."]}
{"query": "What is the annual fee for credit cards in Bangladesh?", "positive": "Most Bangladeshi banks charge annual fees for credit cards ranging from BDT 1,000 to 3,000 depending on card type and facilities.", "negatives": ["Home loan repayment tenures can go up to 20 years.", "Mutual funds in Bangladesh are regulated by the BSEC."]}
{"query": "Are Islamic bank accounts interest-free in Bangladesh?", "positive": "Yes, Islamic banks in Bangladesh operate on Shariah principles, meaning savings accounts work under profit-sharing instead of interest.", "negatives": ["Income tax in Bangladesh is progressive with different slabs.", "Property inheritance laws differ between Muslims and Hindus."]}
{"query": "What is the daily withdrawal limit from an ATM in Bangladesh?", "positive": "Most Bangladeshi banks set ATM withdrawal limits between BDT 20,000 and 50,000 per day depending on card type.", "negatives": ["Student loans usually require a guarantor.", "Government bonds can be purchased from post offices."]}
{"query": "Is online banking safe in Bangladesh?", "positive": "Online banking in Bangladesh is regulated by Bangladesh Bank with two-factor authentication and encryption standards for transactions.", "negatives": ["SME loans are eligible for Bangladesh Bank refinance schemes.", "Life insurance premiums are determined by age and policy type."]}
{"query": "Do Bangladeshi banks provide prepaid cards?", "positive": "Yes, many banks in Bangladesh offer prepaid cards which can be loaded with money and used for local and international transactions.", "negatives": ["Agricultural loans often come with subsidized interest.", "TIN certificates are required for income tax filing."]}
{"query": "What is the difference between debit and credit cards in Bangladesh?", "positive": "Debit cards deduct money directly from the account balance, while credit cards provide a credit limit set by the bank.", "negatives": ["Microfinance loans are usually disbursed weekly or monthly.", "Government savings certificates offer fixed interest rates."]}
{"query": "Are student accounts available in Bangladeshi banks?", "positive": "Yes, many banks such as Dutch-Bangla Bank and Sonali Bank offer student accounts with low minimum balance requirements and no annual fees.", "negatives": ["Inheritance distribution is based on religious law in Bangladesh.", "Mobile banking transactions have daily limits."]}
{"query": "Can I link my mobile banking account with my bank account in Bangladesh?", "positive": "Yes, mobile financial services like bKash and Nagad can be linked to a bank account for fund transfers and cash-in/cash-out services.", "negatives": ["Retirement savings in Bangladesh include provident funds and pension schemes.", "Property loans require registration and mortgage documents."]}
{"query": "Can I invest in government treasury bonds in Bangladesh as an individual?", "positive": "Yes, individuals in Bangladesh can invest in treasury bonds through Bangladesh Bank or designated commercial banks.", "negatives": ["Debit cards are directly linked to bank account balances.", "Microfinance loans are usually disbursed by NGOs like BRAC and ASA."]}
{"query": "What are government savings certificates in Bangladesh?", "positive": "Government savings certificates (Sanchayapatra) are fixed-income instruments issued by the government of Bangladesh with attractive interest rates, often used for safe long-term investment.", "negatives": ["Student loans usually require a guarantor.", "Mobile financial services in Bangladesh have transaction limits."]}
{"query": "Is real estate considered a safe investment in Dhaka?", "positive": "Real estate in Dhaka is considered a relatively safe long-term investment due to urban growth and rising land demand, though it requires large capital.", "negatives": ["Islamic bank accounts are interest-free under profit-sharing principles.", "Agricultural loans are disbursed through Krishi Bank."]}
{"query": "What is portfolio rebalancing in investment?", "positive": "Portfolio rebalancing is the process of realigning the weight of assets in an investment portfolio to maintain the desired risk-return ratio.", "negatives": ["Insurance premiums in Bangladesh are based on age and policy type.", "TIN certificates are required for income tax filing."]}
{"query": "Do banks in Bangladesh offer retirement savings schemes?", "positive": "Yes, many banks in Bangladesh offer retirement savings schemes, such as monthly income plans and pension funds, to help individuals save for old age.", "negatives": ["Home loan tenures can extend up to 20 years.", "Credit card cash withdrawals incur high charges."]}
{"query": "Are mutual funds available in the Dhaka Stock Exchange?", "positive": "Yes, the Dhaka Stock Exchange offers both open-ended and closed-ended mutual funds regulated by the Bangladesh Securities and Exchange Commission (BSEC).", "negatives": ["NGO loans are collateral-free.", "Inheritance laws in Bangladesh differ by religion."]}
{"query": "What is the minimum investment in savings certificates in Bangladesh?", "positive": "The minimum investment in government savings certificates in Bangladesh is typically BDT 10,000.", "negatives": ["Student bank accounts require a valid student ID card.", "ATM withdrawal limits are set daily between BDT 20,000 and 50,000."]}
{"query": "Do Bangladeshi expatriates have investment options at home?", "positive": "Yes, Bangladeshi expatriates can invest in NRB bonds, savings certificates, and real estate projects back home.", "negatives": ["Fraudulent SMS scams are common in mobile banking.", "Agricultural loans are monitored by Bangladesh Bank."]}
{"query": "What is the interest rate for government bonds in Bangladesh?", "positive": "The interest rate for government bonds in Bangladesh varies depending on the maturity period, typically between 8% and 12%.", "negatives": ["Islamic savings accounts operate under Mudarabah or profit-sharing.", "SME loans can be refinanced under Bangladesh Bank schemes."]}
{"query": "Can retirees receive monthly income from savings certificates?", "positive": "Yes, Bangladesh offers pensioner and family savings certificates that provide fixed monthly income for retirees.", "negatives": ["Debit card fees depend on the issuing bank.", "Credit card annual fees range between BDT 1,000 and 3,000."]}
{"query": "Is life insurance mandatory in Bangladesh?", "positive": "Life insurance is not mandatory in Bangladesh, but it is widely offered by state-owned and private companies regulated by the Insurance Development and Regulatory Authority (IDRA).", "negatives": ["Debit cards in Bangladesh are directly linked to accounts.", "Government savings certificates are fixed-income instruments."]}
{"query": "Which organization regulates insurance companies in Bangladesh?", "positive": "The Insurance Development and Regulatory Authority (IDRA) regulates insurance companies in Bangladesh.", "negatives": ["The National Board of Revenue (NBR) manages taxation.", "Bangladesh Bank oversees banking and monetary policy."]}
{"query": "Are health insurance policies common in Bangladesh?", "positive": "Health insurance is still limited in Bangladesh, though some banks and private insurers now offer policies covering hospitalization and treatment costs.", "negatives": ["Agricultural loans are subsidized under Bangladesh Bank schemes.", "Credit card cash withdrawal fees are relatively high."]}
{"query": "Does Sadharan Bima Corporation offer general insurance?", "positive": "Yes, Sadharan Bima Corporation is the state-owned general insurance provider in Bangladesh, covering property, motor, and fire insurance.", "negatives": ["BRAC offers microfinance loans in rural Bangladesh.", "Student accounts are available with low balance requirements."]}
{"query": "Are Islamic insurance products available in Bangladesh?", "positive": "Yes, Takaful insurance, which follows Shariah principles, is offered by several Islamic insurance companies in Bangladesh.", "negatives": ["TIN certificates are required for tax filing.", "Mobile banking transactions are limited by daily caps."]}
{"query": "Is motor vehicle insurance compulsory in Bangladesh?", "positive": "Yes, third-party motor vehicle insurance is compulsory in Bangladesh under the Motor Vehicles Ordinance.", "negatives": ["Government bonds can be purchased through banks and post offices.", "Portfolio rebalancing ensures proper risk-return ratio in investments."]}
{"query": "Can farmers get crop insurance in Bangladesh?", "positive": "Yes, crop insurance schemes have been introduced in Bangladesh, often subsidized by the government to protect farmers against natural disasters.", "negatives": ["Inheritance laws differ for Muslims and Hindus.", "Mutual funds are regulated by the BSEC."]}
{"query": "What is fire insurance in Bangladesh?", "positive": "Fire insurance in Bangladesh provides financial coverage for damages caused by fire accidents to homes, factories, and commercial establishments.", "negatives": ["Salary loans are provided to permanent employees.", "ATM withdrawal limits are fixed by banks."]}
{"query": "Does Jiban Bima Corporation provide life insurance?", "positive": "Yes, Jiban Bima Corporation is the state-owned life insurance company in Bangladesh.", "negatives": ["BRAC provides microfinance loans to rural entrepreneurs.", "Bangladesh Bank regulates mobile financial services."]}
{"query": "Can insurance premiums in Bangladesh be paid through mobile banking?", "positive": "Yes, many insurers in Bangladesh now accept premium payments through bKash, Nagad, and Rocket.", "negatives": ["Savings certificates require a minimum investment of BDT 10,000.", "Credit card annual fees vary between banks."]}
{"query": "Is there a tax-free limit for income in Bangladesh?", "positive": "Personal income tax in Bangladesh has a tax-free threshold set by the National Board of Revenue (NBR), currently BDT 3,50,000 for individuals.", "negatives": ["VAT is charged at multiple stages of production.", "Withholding tax applies to consultancy services."]}
{"query": "Where do I collect my TIN certificate in Bangladesh?", "positive": "A Taxpayer Identification Number (TIN) certificate can be obtained online through the National Board of Revenue (NBR) e-TIN registration system.", "negatives": ["Islamic savings accounts operate under profit-sharing.", "Student loans require a guardian guarantor."]}
{"query": "What is the deadline for filing income tax returns in Bangladesh?", "positive": "The deadline for submitting income tax returns in Bangladesh is usually November 30 each year, unless extended by the NBR.", "negatives": ["Government savings certificates provide fixed interest rates.", "Debit card ATM withdrawals have daily limits."]}
{"query": "Is property tax applicable in Dhaka city?", "positive": "Yes, property owners in Dhaka must pay holding tax to Dhaka North and South City Corporations based on property valuation.", "negatives": ["Insurance companies are regulated by the IDRA.", "Mobile banking allows fund transfers between banks."]}
{"query": "Do car owners pay annual taxes in Bangladesh?", "positive": "Yes, private car owners in Bangladesh must pay annual motor vehicle taxes based on engine CC capacity.", "negatives": ["BRAC and ASA provide collateral-free microloans.", "Mutual funds are listed in the Dhaka Stock Exchange."]}
{"query": "What is the VAT rate in Bangladesh?", "positive": "The standard Value Added Tax (VAT) rate in Bangladesh is 15% on most goods and services.", "negatives": ["Provident funds are a form of retirement savings.", "Crop insurance protects farmers against natural disasters."]}
{"query": "Are tax rebates available for women in Bangladesh?", "positive": "Yes, women and senior citizens in Bangladesh have higher tax-free thresholds as part of income tax rebates.", "negatives": ["Portfolio rebalancing adjusts investment risk levels.", "Student accounts in banks require a valid ID."]}
{"query": "Do freelancers have to pay taxes in Bangladesh?", "positive": "Yes, freelancers in Bangladesh must declare income and pay tax if their earnings exceed the tax-free limit, as per NBR guidelines.", "negatives": ["Life insurance policies usually have 10 to 25 year terms.", "Cooperative societies provide small business loans."]}
{"query": "Can I pay my taxes online in Bangladesh?", "positive": "Yes, the NBR provides online payment facilities for income tax, VAT, and other taxes through Sonali Bank’s portal.", "negatives": ["Agricultural loans often carry subsidized interest rates.", "Debit cards deduct funds directly from accounts."]}
{"query": "What is advance income tax in Bangladesh?", "positive": "Advance Income Tax (AIT) is collected at source in Bangladesh, for example on imported goods or vehicle registration, and adjusted during annual tax filing.", "negatives": ["Government bonds offer fixed annual returns.", "NGOs provide microfinance loans without collateral."]}
{"query": "How can I register a small business in Bangladesh?", "positive": "Small businesses in Bangladesh can be registered through the Registrar of Joint Stock Companies and Firms (RJSC).", "negatives": ["Debit cards are directly linked to account balances.", "Government bonds are sold via banks and post offices."]}
{"query": "What is BSCIC’s role for entrepreneurs in Bangladesh?", "positive": "The Bangladesh Small and Cottage Industries Corporation (BSCIC) supports entrepreneurs by providing training, industrial plots, and financing support.", "negatives": ["Life insurance is regulated by the IDRA.", "TIN certificates are issued by the NBR."]}
{"query": "Are SME loans available for startups in Bangladesh?", "positive": "Yes, SME loans are widely available for startups in Bangladesh and are often supported by Bangladesh Bank’s refinance schemes.", "negatives": ["VAT in Bangladesh is 15%.", "Debit card withdrawal limits are fixed daily."]}
{"query": "What is an accelerator program in Bangladesh?", "positive": "Accelerator programs in Bangladesh, such as GP Accelerator, provide mentoring, networking, and funding opportunities for startups.", "negatives": ["Crop insurance covers farmers against natural disasters.", "Savings certificates are fixed-income government instruments."]}
{"query": "Do women entrepreneurs get special loan facilities in Bangladesh?", "positive": "Yes, Bangladesh Bank mandates that commercial banks allocate a portion of SME financing to women entrepreneurs at concessional rates.", "negatives": ["Car owners in Bangladesh must pay annual vehicle tax.", "Mobile financial services are regulated by Bangladesh Bank."]}
{"query": "How do I get trade license for my small business in Dhaka?", "positive": "Trade licenses in Dhaka are issued by Dhaka North or South City Corporations and are mandatory for running a business.", "negatives": ["Government savings certificates provide fixed returns.", "Mutual funds are regulated by the BSEC."]}
{"query": "What funding sources exist for Bangladeshi startups?", "positive": "Bangladeshi startups can access funding from angel investors, venture capital firms, government funds, and accelerator programs.", "negatives": ["Insurance premiums vary by policy type.", "ATM withdrawal limits differ across banks."]}
{"query": "What logistics challenges do startups face in Bangladesh?", "positive": "Startups in Bangladesh often face logistics challenges such as high transportation costs, customs delays, and weak supply chain infrastructure.", "negatives": ["Student loans require guardian guarantors.", "Inheritance laws differ for Muslims and Hindus."]}
{"query": "Does Bangladesh have an e-commerce policy for small businesses?", "positive": "Yes, Bangladesh has an e-commerce policy framework that regulates online trade, digital payments, and consumer protection.", "negatives": ["Salary loans are available to permanent employees.", "Crop insurance is subsidized for farmers."]}
{"query": "Can startups in Bangladesh get international funding?", "positive": "Yes, startups in Bangladesh can attract international funding, but foreign direct investment must comply with Bangladesh Bank and BIDA regulations.", "negatives": ["Property tax is collected by Dhaka City Corporations.", "Islamic bank accounts work under profit-sharing instead of interest."]}
{"query": "How is property inherited under Muslim law in Bangladesh?", "positive": "Under Muslim inheritance law in Bangladesh, property is distributed according to Shariah principles, where fixed shares are allocated to heirs such as sons, daughters, spouses, and parents.", "negatives": ["TIN certificates are issued by the National Board of Revenue.", "Government savings certificates are fixed-income instruments."]}
{"query": "What law applies to Hindu inheritance in Bangladesh?", "positive": "Hindu inheritance in Bangladesh is governed by the Dayabhaga system, where property is distributed among heirs after the father’s death.", "negatives": ["Islamic bank accounts follow profit-sharing instead of interest.", "VAT in Bangladesh is charged at 15%."]}
{"query": "Can women inherit property in Bangladesh?", "positive": "Yes, women can inherit property in Bangladesh, though the share depends on religious law. Under Muslim law, women generally receive half of a male heir’s share.", "negatives": ["Mutual funds are regulated by the BSEC.", "Crop insurance protects farmers against disasters."]}
{"query": "What is a wasiat (will) in Bangladesh?", "positive": "A wasiat is a written will under Muslim law in Bangladesh, allowing a person to bequeath up to one-third of their property to non-heirs.", "negatives": ["Debit cards are linked to customer accounts.", "Student accounts require valid student ID."]}
{"query": "How is joint property divided in Bangladesh?", "positive": "Joint property in Bangladesh is divided through partition suits filed in civil court, where the court ensures legal distribution among co-owners.", "negatives": ["Life insurance premiums depend on age and type.", "Trade licenses are issued by city corporations."]}
{"query": "Can foreigners inherit property in Bangladesh?", "positive": "Foreigners cannot inherit immovable property in Bangladesh, as land ownership is restricted to Bangladeshi citizens.", "negatives": ["Advance income tax is deducted at source.", "Accelerator programs provide startup mentoring."]}
{"query": "Do heirs need succession certificates in Bangladesh?", "positive": "Yes, heirs often require succession certificates issued by court to claim movable assets like bank deposits and shares.", "negatives": ["NGOs provide collateral-free microloans.", "ATM withdrawal limits vary by bank."]}
{"query": "What happens to bank accounts after the account holder’s death in Bangladesh?", "positive": "After an account holder’s death, heirs must present succession certificates or nominee details to claim the bank deposits.", "negatives": ["Motor vehicle tax depends on engine CC.", "Mobile banking has daily transaction limits."]}
{"query": "Is agricultural land inheritable in Bangladesh?", "positive": "Yes, agricultural land in Bangladesh is inheritable under both Muslim and Hindu laws, subject to land ceiling regulations.", "negatives": ["Government bonds yield 8–12% interest.", "Health insurance covers hospitalization costs."]}
{"query": "Can property be gifted in Bangladesh?", "positive": "Yes, under Muslim law in Bangladesh, a person can gift property during their lifetime through a registered deed called ‘hiba’.", "negatives": ["Provident funds are a retirement saving scheme.", "SME loans can be refinanced by Bangladesh Bank."]}
{"query": "What is an emergency fund in Bangladesh?", "positive": "An emergency fund in Bangladesh is a personal savings buffer set aside for unexpected expenses such as medical emergencies or job loss.", "negatives": ["Car loans require proof of income.", "Inheritance laws differ by religion."]}
{"query": "How much should I save monthly for an emergency fund in Bangladesh?", "positive": "Financial advisors in Bangladesh recommend saving at least 3 to 6 months of living expenses in an emergency fund.", "negatives": ["Government savings certificates require a minimum of BDT 10,000.", "TIN certificates are issued online by the NBR."]}
{"query": "Are recurring deposit schemes available in Bangladesh?", "positive": "Yes, banks in Bangladesh offer recurring deposit schemes where customers can deposit fixed amounts monthly and receive interest on maturity.", "negatives": ["Crop insurance protects against floods.", "Debit cards deduct funds directly from accounts."]}
{"query": "Can I track my expenses with mobile apps in Bangladesh?", "positive": "Yes, several mobile apps and fintech services in Bangladesh allow users to track expenses and manage monthly budgets.", "negatives": ["Motor vehicle insurance is mandatory.", "SME loans are supported under refinance schemes."]}
{"query": "What is big purchase planning?", "positive": "Big purchase planning involves setting aside money regularly for large expenses such as buying a car, land, or paying education fees.", "negatives": ["Portfolio rebalancing maintains investment ratios.", "Advance Income Tax is deducted at source."]}
{"query": "Do Bangladeshi banks offer DPS accounts?", "positive": "Yes, Deposit Pension Scheme (DPS) accounts are common in Bangladesh, where customers save fixed monthly amounts to receive a lump sum at maturity.", "negatives": ["Microfinance loans are collateral-free.", "Mutual funds are listed in the Dhaka Stock Exchange."]}
{"query": "What percentage of salary should I save in Bangladesh?", "positive": "In Bangladesh, a common rule is to save 20% of monthly income towards future goals and emergency funds.", "negatives": ["Property tax is collected by city corporations.", "Islamic insurance follows Takaful principles."]}
{"query": "Can I open multiple savings accounts in Bangladesh?", "positive": "Yes, individuals in Bangladesh can open multiple savings accounts across different banks, though KYC requirements must be met.", "negatives": ["VAT is fixed at 15% on most services.", "Startups can seek funding through accelerators."]}
{"query": "Are joint savings accounts available in Bangladeshi banks?", "positive": "Yes, most banks in Bangladesh allow joint savings accounts that can be operated by two or more persons.", "negatives": ["Motor vehicle tax depends on engine size.", "Government bonds yield fixed interest rates."]}
{"query": "What is budget reeling in practice?", "positive": "Budget reeling in Bangladesh refers to tightening spending habits to cut unnecessary expenses and increase monthly savings.", "negatives": ["TIN certificates are required for tax filing.", "Fire insurance covers property damages."]}
{"query": "What is inflation in Bangladesh?", "positive": "Inflation in Bangladesh refers to the general increase in the price of goods and services, measured by the Consumer Price Index (CPI).", "negatives": ["Islamic bank accounts operate under profit-sharing.", "Motor vehicle tax is paid annually."]}
{"query": "What is a fixed deposit account?", "positive": "A fixed deposit account in Bangladesh is a savings product where money is locked for a fixed period and earns higher interest rates than regular accounts.", "negatives": ["Inheritance laws determine property distribution.", "Government bonds are sold via banks and post offices."]}
{"query": "What is liquidity?", "positive": "Liquidity refers to how quickly an asset in Bangladesh can be converted into cash without significant loss of value.", "negatives": ["Insurance premiums depend on age and policy type.", "SME loans are supported by Bangladesh Bank refinance schemes."]}
{"query": "What is the difference between direct and indirect tax?", "positive": "Direct taxes in Bangladesh are levied on income and property, while indirect taxes like VAT are applied to goods and services.", "negatives": ["Debit card limits vary across banks.", "Crop insurance covers farmers against disasters."]}
{"query": "What is compound interest?", "positive": "Compound interest means earning interest on both the initial principal and the accumulated interest from previous periods.", "negatives": ["Provident funds are long-term retirement savings.", "TIN certificates are required for filing taxes."]}
{"query": "What is financial literacy?", "positive": "Financial literacy in Bangladesh means having the knowledge to manage personal finances, including budgeting, savings, and investments.", "negatives": ["Student loans require guarantors.", "Mobile banking has daily transaction limits."]}
{"query": "What is diversification in investment?", "positive": "Diversification in Bangladesh means spreading investments across different asset classes to reduce overall risk.", "negatives": ["Trade licenses are issued by city corporations.", "Life insurance is regulated by IDRA."]}
{"query": "What is a credit score?", "positive": "A credit score in Bangladesh reflects a borrower’s repayment history and is used by banks to evaluate loan applications.", "negatives": ["Government savings certificates have fixed interest.", "Joint property is divided through partition suits."]}
{"query": "What is risk management?", "positive": "Risk management is the practice of identifying, analyzing, and mitigating financial risks such as credit risk, market risk, or operational risk.", "negatives": ["Mutual funds are regulated by BSEC.", "Property tax is collected by Dhaka City Corporations."]}
{"query": "What is GDP?", "positive": "Gross Domestic Product (GDP) in Bangladesh represents the total monetary value of all goods and services produced within the country in a given year.", "negatives": ["Debit cards withdraw directly from bank accounts.", "SME loans are offered by commercial banks."]}
{"query": "What are common mobile banking scams in Bangladesh?", "positive": "Common mobile banking scams in Bangladesh include fake SMS about prize money, phishing calls pretending to be from banks, and OTP theft.", "negatives": ["Agricultural loans are subsidized by Bangladesh Bank.", "Government savings certificates provide fixed returns."]}
{"query": "How to identify a phishing email from a bank?", "positive": "Phishing emails often use fake domains, urgent language, and links asking for login credentials, which no legitimate Bangladeshi bank would request.", "negatives": ["Student bank accounts have low minimum balance requirements.", "Insurance premiums depend on age and coverage."]}
{"query": "What should I do if I lose my credit card in Bangladesh?", "positive": "If you lose your credit card in Bangladesh, immediately call your bank’s hotline to block the card and prevent fraudulent transactions.", "negatives": ["Microfinance loans are collateral-free.", "Crop insurance protects farmers against floods."]}
{"query": "Are there fake investment schemes in Bangladesh?", "positive": "Yes, fake investment schemes exist in Bangladesh where fraudsters promise unusually high returns without regulatory approval from BSEC.", "negatives": ["Motor vehicle tax is based on engine size.", "TIN certificates are mandatory for tax filing."]}
{"query": "How to avoid ATM skimming fraud?", "positive": "To avoid ATM skimming in Bangladesh, check card slots for tampering, cover the keypad while entering PIN, and use ATMs in secure locations.", "negatives": ["Portfolio rebalancing manages risk levels.", "Life insurance is provided by Jiban Bima Corporation."]}
{"query": "Is OTP sharing safe in Bangladesh?", "positive": "No, sharing your One-Time Password (OTP) is unsafe. Banks in Bangladesh repeatedly warn customers never to disclose OTPs over phone or SMS.", "negatives": ["SME loans are eligible for refinance schemes.", "Government bonds yield 8–12% annual interest."]}
{"query": "Are lottery SMS messages a scam in Bangladesh?", "positive": "Yes, SMS messages claiming you won lottery or prize money are scams in Bangladesh, often used to trick people into sharing bank details.", "negatives": ["Inheritance property is divided under religious law.", "Student loans require guardians as guarantors."]}
{"query": "What is digital banking fraud?", "positive": "Digital banking fraud in Bangladesh includes unauthorized online transfers, hacking, and identity theft using fake apps or phishing links.", "negatives": ["Crop insurance is offered to farmers.", "Joint property disputes are handled in civil courts."]}
{"query": "Can fraud happen in online shopping in Bangladesh?", "positive": "Yes, fraud can occur in online shopping in Bangladesh through fake e-commerce sites, advance payment scams, or delivery of counterfeit goods.", "negatives": ["Motor insurance is compulsory in Bangladesh.", "ATM withdrawal limits are set daily."]}
{"query": "Where can I report financial fraud in Bangladesh?", "positive": "Financial fraud in Bangladesh can be reported to Bangladesh Bank’s complaint cell, local police, or the Cyber Crime Unit.", "negatives": ["DPS accounts allow monthly savings.", "VAT in Bangladesh is 15%."]}
