{"query": "What is personal income tax in Bangladesh?", "positive": "Personal income tax in Bangladesh is a direct tax imposed on individuals' annual income by the National Board of Revenue (NBR). The tax follows a progressive structure with multiple income slabs. For the financial year 2023-24, the tax-free threshold is BDT 3,50,000 for regular taxpayers, BDT 4,00,000 for women and senior citizens (65+ years), and BDT 4,50,000 for persons with disabilities and freedom fighters. Tax rates range from 5% to 25% depending on income levels.", "negatives": ["This question is about corporate tax rates which differ from personal income tax.", "Value Added Tax (VAT) is a different type of tax applied to goods and services."], "category": "general"}
{"query": "What are the income tax brackets for individuals in Bangladesh?", "positive": "Bangladesh income tax brackets for FY 2023-24: \n- Up to BDT 3,50,000: 0% (tax-free for regular taxpayers)\n- BDT 3,50,001 to BDT 5,00,000: 5%\n- BDT 5,00,001 to BDT 6,50,000: 10%\n- BDT 6,50,001 to BDT 10,00,000: 15%\n- BDT 10,00,001 to BDT 15,00,000: 20%\n- Above BDT 15,00,000: 25%\nWomen and senior citizens get higher tax-free thresholds of BDT 4,00,000.", "negatives": ["This question is about corporate tax rates which differ from personal income tax.", "Value Added Tax (VAT) is a different type of tax applied to goods and services."], "category": "tax_brackets"}
{"query": "How is income taxed for salaried people in Bangladesh?", "positive": "Salaried employees in Bangladesh are subject to Tax Deducted at Source (TDS) by their employers. The employer calculates annual tax liability based on the progressive tax rates and deducts tax monthly. Employees must submit income tax returns by November 30th each year. They can claim various rebates including investment tax credit up to BDT 15,00,000 (25% rebate), life insurance premium rebate, and provident fund contributions. House rent allowance up to 50% of basic salary or actual rent (whichever is lower) is tax-exempt.", "negatives": ["This question is about corporate tax rates which differ from personal income tax.", "Value Added Tax (VAT) is a different type of tax applied to goods and services."], "category": "salary_tax"}
{"query": "Is there a tax-free limit for income in Bangladesh?", "positive": "Yes, Bangladesh has tax-free income thresholds for FY 2023-24:\n- Regular taxpayers: BDT 3,50,000\n- Women taxpayers: BDT 4,00,000\n- Senior citizens (65+ years): BDT 4,00,000\n- Persons with disabilities: BDT 4,50,000\n- Freedom fighters: BDT 4,50,000\n- Gazetted war-wounded freedom fighters: BDT 5,00,000\nIncome below these limits is completely tax-free.", "negatives": ["This question is about corporate tax rates which differ from personal income tax.", "Value Added Tax (VAT) is a different type of tax applied to goods and services."], "category": "tax_free_limits"}
{"query": "How much tax should I pay on my salary in Bangladesh?", "positive": "Salary tax in Bangladesh depends on your annual income and applicable tax rates. For example:\n- Salary BDT 5,00,000: Tax = 0 (below threshold)\n- Salary BDT 8,00,000: Tax = BDT 22,500 (5% on BDT 1,50,000 + 10% on BDT 1,50,000 + 15% on BDT 1,50,000)\n- Salary BDT 12,00,000: Tax = BDT 82,500\nYour employer will deduct TDS monthly. You can reduce tax through investment rebates (up to 25% on BDT 15,00,000 investment), life insurance, and provident fund contributions.", "negatives": ["This question is about corporate tax rates which differ from personal income tax.", "Value Added Tax (VAT) is a different type of tax applied to goods and services."], "category": "salary_calculation"}
{"query": "When is personal income tax due in Bangladesh?", "positive": "Personal income tax return filing deadlines in Bangladesh:\n- Individual taxpayers: November 30th of the following financial year\n- Companies: September 15th\n- Non-resident individuals: November 30th\nFor FY 2022-23, the deadline was November 30, 2023. Late filing attracts penalties. Tax payments can be made online through the NBR e-filing system, mobile financial services (bKash, Nagad), or authorized banks. Advanced tax payments are due by June 15th for the current financial year.", "negatives": ["This question is about corporate tax rates which differ from personal income tax.", "Value Added Tax (VAT) is a different type of tax applied to goods and services."], "category": "deadlines"}
{"query": "What are the penalties for not paying personal tax in Bangladesh?", "positive": "Penalties for non-compliance with personal income tax in Bangladesh:\n- Late filing: 50% of payable tax or minimum BDT 1,000\n- Non-filing: 100% of payable tax or minimum BDT 5,000\n- Concealment of income: 50% penalty on concealed amount\n- False statement: Fine up to BDT 10,000 plus 100% penalty\n- Interest: 2% per month on unpaid tax\n- Criminal prosecution possible for serious tax evasion\nThe NBR may also freeze bank accounts and impose travel restrictions for defaulters.", "negatives": ["This question is about corporate tax rates which differ from personal income tax.", "Value Added Tax (VAT) is a different type of tax applied to goods and services."], "category": "penalties"}
{"query": "Can I get tax rebate on donations in Bangladesh?", "positive": "Yes, donations qualify for tax rebates in Bangladesh:\n- Donations to approved charitable organizations: 10% of total income or actual donation (whichever is lower)\n- Donations for Liberation War Museum, Shaheed Minar: 100% rebate\n- Donations to Prime Minister's Relief Fund: 100% rebate\n- Zakat payments: Can be claimed as rebate\n- Educational institution donations (approved): Up to 20% rebate\nMaximum total rebate including all sources cannot exceed 30% of total income. Proper receipts and documentation required for claims.", "negatives": ["This question is about corporate tax rates which differ from personal income tax.", "Value Added Tax (VAT) is a different type of tax applied to goods and services."], "category": "donations"}
{"query": "How to file personal income tax return in Bangladesh?", "positive": "Steps to file personal income tax return in Bangladesh:\n1. Obtain TIN (Tax Identification Number) from NBR\n2. Register on NBR's online tax portal (incometax.gov.bd)\n3. Download appropriate return form (IT-11GA for individuals)\n4. Fill in income details, tax calculations, rebates\n5. Submit online with required documents\n6. Pay any due tax through online banking/mobile banking\n7. Get acknowledgment receipt\nRequired documents: Salary certificate, bank statements, investment certificates, TDS certificates. E-filing is mandatory for income above BDT 4,00,000.", "negatives": ["This question is about corporate tax rates which differ from personal income tax.", "Value Added Tax (VAT) is a different type of tax applied to goods and services."], "category": "filing_process"}
{"query": "Is agricultural income taxable in Bangladesh?", "positive": "Agricultural income taxation in Bangladesh:\n- Pure agricultural income: Generally tax-exempt\n- Income from sale of processed agricultural products: Taxable\n- Rent from agricultural land: Taxable as house property income\n- Agricultural business income: Taxable under business income\n- Dividend from agricultural companies: Taxable\n- If agricultural income exceeds BDT 5,00,000, it affects tax rates for non-agricultural income\nLand revenue/khajna paid to government is deductible from agricultural income.", "negatives": ["This question is about corporate tax rates which differ from personal income tax.", "Value Added Tax (VAT) is a different type of tax applied to goods and services."], "category": "agricultural"}
